# Pandas

In [2]:
import pandas as pd

# Series

In [7]:
#Series
city1=pd.Series([12,-6,8,-3])
city1

0    12
1    -6
2     8
3    -3
dtype: int64

In [3]:
#to get values in series
city1.values

array([12, -6,  8, -3], dtype=int64)

In [4]:
#to get index
city1.index

RangeIndex(start=0, stop=4, step=1)

In [5]:
city1.dtype

dtype('int64')

In [8]:
#to change index value
city2=pd.Series([12,-6,8,-3],index=['Day 1','Day 2','Day 3','Day 4'])
city2

Day 1    12
Day 2    -6
Day 3     8
Day 4    -3
dtype: int64

In [10]:
# to get value of particular index
city2['Day 3']

8

In [11]:
# To get multiple value
city2[['Day 1','Day 2', 'Day 3']]

Day 1    12
Day 2    -6
Day 3     8
dtype: int64

In [12]:
# to check which value is > 0
city2>0

Day 1     True
Day 2    False
Day 3     True
Day 4    False
dtype: bool

In [13]:
# taking out the value >0
city2[city2>0]

Day 1    12
Day 3     8
dtype: int64

In [15]:
#minimum and maximum
city2.min()

-6

In [16]:
city2.max()

12

In [18]:
# to get values between a range
city2[(city2>2)&(city2<9)]

Day 3    8
dtype: int64

In [19]:
# scalar function
city2+3

Day 1    15
Day 2    -3
Day 3    11
Day 4     0
dtype: int64

In [20]:
city2-3

Day 1    9
Day 2   -9
Day 3    5
Day 4   -6
dtype: int64

In [21]:
city2*3

Day 1    36
Day 2   -18
Day 3    24
Day 4    -9
dtype: int64

In [22]:
city2/3

Day 1    4.000000
Day 2   -2.000000
Day 3    2.666667
Day 4   -1.000000
dtype: float64

In [24]:
# converting data into Series
data={'Kerala':28,'Andhra':25,'TN':31,'Karnataka':19,'Delhi':38}
pd.Series(data)

Kerala       28
Andhra       25
TN           31
Karnataka    19
Delhi        38
dtype: int64

In [25]:
data=pd.Series(data)

In [26]:
data

Kerala       28
Andhra       25
TN           31
Karnataka    19
Delhi        38
dtype: int64

In [34]:
states=['Andhra','Delhi','TN','MP','Kerala',"Karnataka"]
city3=pd.Series(data,index=states)

In [35]:
# it will give NaN, if doesn't contain any value 
city3

Andhra       25.0
Delhi        38.0
TN           31.0
MP            NaN
Kerala       28.0
Karnataka    19.0
dtype: float64

In [36]:
# .isna()function. will give true is there is any NaN value, otherwise false
city3.isna()

Andhra       False
Delhi        False
TN           False
MP            True
Kerala       False
Karnataka    False
dtype: bool

In [37]:
# to get index with NaN value
city3[city3.isna()]

MP   NaN
dtype: float64

In [38]:
# .notna() function.(opposite of .isna())
city3.notna()

Andhra        True
Delhi         True
TN            True
MP           False
Kerala        True
Karnataka     True
dtype: bool

In [39]:
city3[city3.notna()]

Andhra       25.0
Delhi        38.0
TN           31.0
Kerala       28.0
Karnataka    19.0
dtype: float64

# DataFrame

In [40]:
data={'Year':[2001,2002,2004,2005,2006],
     'State':['Kerala','TN','Andhra','Karnataka','Bihar'],
     'Pop':[300,250,280,400,360]}
data

{'Year': [2001, 2002, 2004, 2005, 2006],
 'State': ['Kerala', 'TN', 'Andhra', 'Karnataka', 'Bihar'],
 'Pop': [300, 250, 280, 400, 360]}

In [47]:
# convert the data into DataFrame
pop_data=pd.DataFrame(data)
pop_data

   Year      State  Pop
0  2001     Kerala  300
1  2002         TN  250
2  2004     Andhra  280
3  2005  Karnataka  400
4  2006      Bihar  360

In [46]:
# to add new column to DataFrame
pop_data1=pd.DataFrame(data,columns=['Year','State','Pop','Income'])
pop_data1

   Year      State  Pop Income
0  2001     Kerala  300    NaN
1  2002         TN  250    NaN
2  2004     Andhra  280    NaN
3  2005  Karnataka  400    NaN
4  2006      Bihar  360    NaN

In [48]:
# to get particular column
pop_data1['Pop']

0    300
1    250
2    280
3    400
4    360
Name: Pop, dtype: int64

In [49]:
# to give value to DataFrame
pop_data1['Income']=[20000,30000,25000,12000,15000]

In [50]:
pop_data1

   Year      State  Pop  Income
0  2001     Kerala  300   20000
1  2002         TN  250   30000
2  2004     Andhra  280   25000
3  2005  Karnataka  400   12000
4  2006      Bihar  360   15000

In [51]:
# creating another column in a different method
pop_data1['Debt']=[320,450,200,150,140]
pop_data1

   Year      State  Pop  Income  Debt
0  2001     Kerala  300   20000   320
1  2002         TN  250   30000   450
2  2004     Andhra  280   25000   200
3  2005  Karnataka  400   12000   150
4  2006      Bihar  360   15000   140

In [52]:
# creating column using formula method
pop_data1['Savings']=pop_data1['Income']-pop_data1['Debt']
pop_data1

   Year      State  Pop  Income  Debt  Savings
0  2001     Kerala  300   20000   320    19680
1  2002         TN  250   30000   450    29550
2  2004     Andhra  280   25000   200    24800
3  2005  Karnataka  400   12000   150    11850
4  2006      Bihar  360   15000   140    14860

In [53]:
# to delete a column
del pop_data1['Pop']
pop_data1

   Year      State  Income  Debt  Savings
0  2001     Kerala   20000   320    19680
1  2002         TN   30000   450    29550
2  2004     Andhra   25000   200    24800
3  2005  Karnataka   12000   150    11850
4  2006      Bihar   15000   140    14860

In [55]:
pop_data1['Depth']=600
pop_data1

   Year      State  Income  Debt  Savings  Depth
0  2001     Kerala   20000   320    19680    600
1  2002         TN   30000   450    29550    600
2  2004     Andhra   25000   200    24800    600
3  2005  Karnataka   12000   150    11850    600
4  2006      Bihar   15000   140    14860    600

In [56]:
# to delete column using drop method
pop_data1.drop('Depth')
# error occured bcoz, python by default check into y-axis,but 'Depth' column is present in x-axis.

KeyError: "['Depth'] not found in axis"

In [60]:
pop_data1.drop('Depth',axis=1)

   Year      State  Income  Debt  Savings
0  2001     Kerala   20000   320    19680
1  2002         TN   30000   450    29550
2  2004     Andhra   25000   200    24800
3  2005  Karnataka   12000   150    11850
4  2006      Bihar   15000   140    14860

In [61]:
pop_data1=pop_data1.drop('Depth',axis=1)
pop_data1

   Year      State  Income  Debt  Savings
0  2001     Kerala   20000   320    19680
1  2002         TN   30000   450    29550
2  2004     Andhra   25000   200    24800
3  2005  Karnataka   12000   150    11850
4  2006      Bihar   15000   140    14860

In [62]:
#to find dimension
pop_data1.ndim

2

In [63]:
# to find size or total number of element in the DataFrame
pop_data1.size

25

In [67]:
# to get value from .csv file
auto_data=pd.read_csv('auto-mpg.csv')
auto_data

,mpg,cylinders,displacement,horsepower,weight,acceleration,model year,origin,car name
0,18.0,8,307.0,130,3504,12.0,70,1,chevrolet chevelle malibu
1,15.0,8,350.0,165,3693,11.5,70,1,buick skylark 320
2,18.0,8,318.0,150,3436,11.0,70,1,plymouth satellite
3,16.0,8,304.0,150,3433,12.0,70,1,amc rebel sst
4,17.0,8,302.0,140,3449,10.5,70,1,ford torino
...,...,...,...,...,...,...,...,...,...
393,27.0,4,140.0,86,2790,15.6,82,1,ford mustang gl
394,44.0,4,97.0,52,2130,24.6,82,2,vw pickup
395,32.0,4,135.0,84,2295,11.6,82,1,dodge rampage
396,28.0,4,120.0,79,2625,18.6,82,1,ford ranger
397,31.0,4,119.0,82,2720,19.4,82,1,chevy s-10

In [4]:
iris_data=pd.read_excel('iris.xls')
iris_data

      SL   SW   PL   PW  Classification
0    5.1  3.5  1.4  0.2     Iris-setosa
1    4.9  3.0  1.4  0.2     Iris-setosa
2    4.7  3.2  1.3  0.2     Iris-setosa
3    4.6  3.1  1.5  0.2     Iris-setosa
4    5.0  3.6  1.4  0.2     Iris-setosa
..   ...  ...  ...  ...             ...
145  6.7  3.0  5.2  2.3  Iris-virginica
146  6.3  2.5  5.0  1.9  Iris-virginica
147  6.5  3.0  5.2  2.0  Iris-virginica
148  6.2  3.4  5.4  2.3  Iris-virginica
149  5.9  3.0  5.1  1.8  Iris-virginica

[150 rows x 5 columns]